#### GradientBackgroundSettings Members

---

|  |
| --- |
| GradientBackgroundSettings Class   Methods   Properties   See Also |

The  GradientBackgroundSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  BackgroundSettings  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | GroundColor | The color of the ground. |
| Public property | HorizonColor | The color of the horizon. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  BackgroundSettings  .) |
| Public property | SkyColor | The color of the top of the sky. |

# See Also

GradientBackgroundSettings Class

Autodesk.Revit.DB Namespace